<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name'        => 'meal',
    // 模块标题[必填]
    'title'       => '订餐',
    // 模块唯一标识[必填]，格式：模块名.开发者标识.module
    'identifier'  => 'meal.libing.module',
    // 模块图标[选填]
    'icon'        => 'fa fa-fw fa-newspaper-o',
    // 模块描述[选填]
    'description' => '订餐模块',
    // 开发者[必填]
    'author'      => 'LIBING',
    // 开发者网址[选填]
    'author_url'  => 'https://zskeji.worktile.com',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version'     => '1.0.0',
    // 模块依赖[可选]，格式[[模块名, 模块唯一标识, 依赖版本, 对比方式]]
    'need_module' => [
        ['admin', 'admin.dolphinphp.module', '1.0.0']
    ],
    // 插件依赖[可选]，格式[[插件名, 插件唯一标识, 依赖版本, 对比方式]]
    'need_plugin' => [],
    // 数据表[有数据库表时必填]
    'tables' => [
        'meal_order'
    ],
    // 原始数据库表前缀
    // 用于在导入模块sql时，将原有的表前缀转换成系统的表前缀
    // 一般模块自带sql文件时才需要配置
    'database_prefix' => 'zs_',

    // 模块参数配置
    'config' => [
        ['time','lunch_begin','中饭点餐开始时间','','09:00:00'],
        ['time','lunch_end','中饭点餐截止时间','','10:30:00'],
        ['time','dinner_begin','晚饭点餐开始时间','','15:00:00'],
        ['time','dinner_end','晚饭点餐截止时间','','16:30:00'],
        ['time', 'quit_lunch', '中饭退单截止时间', '','10:30:00'],
        ['time', 'quit_dinner', '晚饭退单截止时间', '','16:30:00']
    ],

    // 行为配置
    'action' => [
    ],

    // 授权配置
    'access' => [
        'group' => [
            "tab_title"   => '栏目授权',
            "table_name"  => "cms_column",
            "primary_key" => "id",
            "parent_id"   => "pid",
            "node_name"   => "name"
        ],
    ],
];
